Revit 2026 API

# NamingUtils Class

---

A collection of utilities related to element naming.

SystemObject Autodesk.Revit.DBNamingUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class NamingUtils
```
```vb
Public NotInheritable Class NamingUtils
```
```cpp
public ref class NamingUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type NamingUtils = class end
```

The NamingUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CompareNames | Compares two object name strings using Revit's comparison rules. |
|  | IsValidName | Identifies if the input string is valid for use as an object name in Revit. |

#### Reference

Autodesk.Revit.DB Namespace